src/InformationRegisters/ПараметрыРабочихСерверов/ПараметрыРабочихСерверов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыРабочихСерверов</name>
  <resources>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </resources>
  <resources>
    <name>КаталогНастроекТЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогНастроекТЖСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОбменаДанными</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОбменаДаннымиСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВременный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </resources>
  <resources>
    <name>ДиапазонПортовОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонПортовДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазоныПортов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйОбъемПамятиРабочихПроцессов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БезопасныйРасходПамятиЗаОдинВызов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПамятиРабочихПроцессовДоКоторогоСерверСчитаетсяПроизводительным</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоИбНаПроцесс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСоединенийНаПроцесс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортГлавногоМенеджераКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МенеджерНаКаждыйСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЦентральныйСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтветственныеЗаНастройкуПроцедур/ОтветственныеЗаНастройкуПроцедур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЗаНастройкуПроцедур</name>
  <resources>
    <name>РольПользователя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКонтрольнойПроцедуры</name>
    <type>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыРабочихСерверов/Forms/ФормаЗначенияПоУмолчанию/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОтветственных();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидКонтрольнойПроцедуры,
	|	РольПользователя
	|ИЗ
	|	РегистрСведений.ОтветственныеЗаНастройкуПроцедур
	|ГДЕ
	|	ОбъектКонтроля = &ВидОбъектаКонтроля
	|	И ВидКонтрольнойПроцедуры В (&ВидыКонтрольныхПроцедур)
	|";
	
	АнализВызововКластера1С = Справочники.ВидыКонтрольныхПроцедур.НайтиПоНаименованию("Анализ вызовов кластера 1С");
	КонтрольУстойчивостиСистемы = Справочники.ВидыКонтрольныхПроцедур.НайтиПоНаименованию("Контроль устойчивости системы");
	МониторингСистемныхОшибок = Справочники.ВидыКонтрольныхПроцедур.НайтиПоНаименованию("Мониторинг системных ошибок");
		
	ВидыКонтрольныхПроцедур = Новый Массив;
	ВидыКонтрольныхПроцедур.Добавить(АнализВызововКластера1С);
	ВидыКонтрольныхПроцедур.Добавить(КонтрольУстойчивостиСистемы);
	ВидыКонтрольныхПроцедур.Добавить(МониторингСистемныхОшибок);
	
	Запрос.УстановитьПараметр("ВидОбъектаКонтроля", Справочники.ВидыОбъектовКонтроля.РабочийСервер);
	Запрос.УстановитьПараметр("ВидыКонтрольныхПроцедур", ВидыКонтрольныхПроцедур);
	
	КонтрольныеПроцедуры = Новый Соответствие;
	КонтрольныеПроцедуры.Вставить(АнализВызововКластера1С, Неопределено);
	КонтрольныеПроцедуры.Вставить(КонтрольУстойчивостиСистемы, Неопределено);
	КонтрольныеПроцедуры.Вставить(МониторингСистемныхОшибок, Неопределено);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		КонтрольныеПроцедуры[Выборка.ВидКонтрольнойПроцедуры] = Выборка.РольПользователя;
	КонецЦикла;
	
	Для Каждого ТекКонтрольнаяПроцедура Из КонтрольныеПроцедуры Цикл
		НовСтрока = ЭтотОбъект.ОтветственныеЗаНастройкуКонтрольныхПроцедур.Добавить();
		НовСтрока.ВидКонтрольнойПроцедуры = ТекКонтрольнаяПроцедура.Ключ;
		НовСтрока.РольПользователя = ТекКонтрольнаяПроцедура.Значение;
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого ТекСтрока Из ЭтотОбъект.ОтветственныеЗаНастройкуКонтрольныхПроцедур Цикл
		МенеджерЗаписи = РегистрыСведений.ОтветственныеЗаНастройкуПроцедур.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектКонтроля = Справочники.ВидыОбъектовКонтроля.РабочийСервер;
		МенеджерЗаписи.ВидКонтрольнойПроцедуры = ТекСтрока.ВидКонтрольнойПроцедуры;
		МенеджерЗаписи.РольПользователя = ТекСтрока.РольПользователя;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Очистить();
КонецПроцедуры
